## 25 Oct 2021

### 5 number sumary

In [2]:
#imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from pydataset import data  #(This is the way to bring in some preloded data)

In [8]:
#just the data fuction data() allows us to see the data sets abalible
data().sample(10)

,dataset_id,title
361,nonEnglishNames,Names with Character Set Problems
601,UKSoccer,UK Soccer Scores
47,mtcars,Motor Trend Car Road Tests
3,Formaldehyde,Determination of Formaldehyde
245,badhealth,badhealth
161,education,Education Expenditure Data
317,ModeChoice,Data to Study Travel Mode Choice
648,birthdeathrates,Birth and Death Rates Data
706,epi,Eysenck Personality Inventory (EPI) data for 3570 participants
431,Boston,Housing Values in Suburbs of Boston

In [7]:
# data is imported using pydataset
data()

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

In [4]:
titanic = data('titanic') # use pydatasete data function to load up the Titanic data 
data('titanic', show_doc=True) # show data documentation

titanic

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## titanic

### Description

The data is an observation-based version of the 1912 Titanic passenger
survival log,

### Usage

    data(titanic)

### Format

A data frame with 1316 observations on the following 4 variables.

`class`

a factor with levels `1st class` `2nd class` `3rd class` `crew`

`age`

a factor with levels `child` `adults`

`sex`

a factor with levels `women` `man`

`survived`

a factor with levels `no` `yes`

### Details

titanic is saved as a data frame. Used to assess risk ratios

### Source

Found in many other texts

### References

Hilbe, Joseph M (2014), Modeling Count Data, Cambridge University Press Hilbe,
Joseph M (2007, 2011), Negative Binomial Regression, Cambridge University
Press Hilbe, Joseph M (2009), Logistic Regression Models, Chapman & Hall/CRC

### Examples

    data(titanic)
    titanic$survival <- titanic$survived == "yes"
    glmlr <- glm(survival ~ age + sex + factor(class), family=binomial, data=titanic)
    summary(glmlr)

In [9]:
#27 OCT 2021
titanic.head()

       class     age  sex survived
1  1st class  adults  man      yes
2  1st class  adults  man      yes
3  1st class  adults  man      yes
4  1st class  adults  man      yes
5  1st class  adults  man      yes

In [46]:
# How many people surved Vs Dead
# Create a varible for ache desired data
# The .shape tell us how many rows and colums are in the data
#
survided = (titanic[titanic['survived'] == 'yes'].shape)[0]
died = (titanic[titanic['survived'] == 'no'].shape)[0]

# Organize the print statement with f string
print(f"In the Titanic {survided} survived and {died} did not.")

In the Titanic 499 survived and 817 did not.

In [72]:
# People that survived or did not in first class
titanic.loc[titanic['class'] == '1st class', 'survived'].value_counts()

yes    203
no     122
Name: survived, dtype: int64

In [73]:
# People that survived or did not in 2nd class
titanic.loc[titanic['class'] == '2nd class', 'survived'].value_counts()

no     167
yes    118
Name: survived, dtype: int64

In [74]:
# People that survived or did not in 3rd class
titanic.loc[titanic['class'] == '3rd class', 'survived'].value_counts()

no     528
yes    178
Name: survived, dtype: int64

## Highst price dictionary

In [4]:
#Sample dddictionary to practice
books = [
    {
        "title": "Genetic Algorithms and Machine Learning for Programmers",
        "price": 36.99,
        "author": "Frances Buontempo"
    },
    {
        "title": "The Visual Display of Quantitative Information",
        "price": 38.00,
        "author": "Edward Tufte"
    },
    {
        "title": "Practical Object-Oriented Design",
        "author": "Sandi Metz",
        "price": 30.47
    },
    {
        "title": "Weapons of Math Destruction",
        "author": "Cathy O'Neil",
        "price": 17.44
    }
]


#highst price of a dictionary 

def highest_price_book(l):
    seq = [x['price'] for x in l]
    return max(seq)
  
    


print(highest_price_book(books))
# odds_lst

38.0